# shell-related
brew "autojump"
brew "bash"
brew "bash-completion"
brew "bat"
brew "delta"
brew "direnv"
brew "exa"
brew "pinentry"
brew "shellcheck"
brew "zsh"
brew "zsh-completions"

# the editor!
brew "neovim"

# programming language-related
brew "node"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "ruby"

# programming and ops tools
brew "awscli"
brew "ctags"
brew "dive"
brew "docker-clean"
brew "git"
brew "git-delta"

# encryption-related
brew "gnupg"
brew "gpgme"
cask "gpg-suite"
brew "openssl"

# mail-related
brew "isync"
brew "neomutt"
brew "notmuch"

# handy cli tools
brew "bottom"
brew "jq"
brew "pstree"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"

# DBs
brew "postgresql"

# commonly needed libs
brew "libffi"
brew "libpng"
brew "libyaml"
brew "readline"
brew "zlib"

# for astronvim
brew "gdu"
brew "lazygit"

