brew "awscli"
brew "bash"
brew "bash-completion"
brew "ctags"
brew "dive"
brew "docker-clean"
brew "git"
brew "gnupg"
brew "libpng"
brew "libyaml"
brew "jq"
brew "neovim"
brew "node"
brew "openssl"
brew "pinentry"
brew "pstree"
brew "pyenv"
brew "pyenv-virtualenv"
brew "readline"
brew "ruby"
brew "shellcheck"
brew "tree"
brew "watch"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-completions"
